Revit 2027 API
BuiltInFailures.StairRampFailures.StairsOtherThan2IntsByRiserAndBoundaryFailure Property
 More than 2 intersection points between riser segment and boundary encountered
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsOtherThan2IntsByRiserAndBoundaryFailure { get; }
Public Shared ReadOnly Property StairsOtherThan2IntsByRiserAndBoundaryFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsOtherThan2IntsByRiserAndBoundaryFailure {
	FailureDefinitionId^ get ();
}
static member StairsOtherThan2IntsByRiserAndBoundaryFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace